Repository: secretflow/secretflow
Catalog: docs/locales/*/LC_MESSAGES/user_guide/federated_learning/vertical_federated_learning/SplitRec/effectiveness/*_rec_deepfm.po
Languages: sl

source: SplitREC: Using DeepFM Algorithm in SecretFlow
sl: SplitRec：在隐语中使用拆分 DeepFM 算法（Tensorflow 后端）

source: The following codes are demos only. It’s NOT for production due to system security concerns, please DO NOT use it directly in production.
sl: 注意： 以下代码仅供演示用途，在演示过程中可能会揭露部分信息。请勿直接将此示例代码用于实际生产环境中。在实际部署前，请根据您的具体需求和安全标准进行必要的修改和调整。

source: SecretFlow framework provides SLModel to meet user’s needs for Vertical Federated Learning. In the vertical scenario, all parties achieve the purpose of training a better model through complementary features and joint training. In actual application scenarios, the recommendation scenario fits well with the vertical federation solution. It has great application prospects. Different data holders have different features and are unwilling to share with each other, but the features are complementary, such as consumer features, financial features and user portraits, etc. However, recommendation algorithms are often not so directly applicable to split learning. For example, the FM algorithm requires feature crossover. Therefore, we provide a special item in SecretFlow, by encapsulating commonly used recommendation algorithms, to facilitate users to use federated learning for recommendation applications. This article will introduce how to use the DeepFM algorithm in SecretFlow.
sl: 隐语在垂直场景提供了SLModel来满足用户的垂直联邦需求，垂直场景中，各方通过特征互补，联合训练来达到训练出更好模型的目的。而在实际的应用场景中，推荐场景和垂直联邦方案非常契合。有很大的应用前景。 不同的数据持有方拥有不同的特征，彼此不愿意分享，但是特征之间是互补的，比如消费特征、金融特征和用户画像等。但是推荐算法往往并不是那么直接可以被应用到拆分学习中，比如FM算法需要特征交叉。 因此我们在隐语中提供了一个专项，通过对常用的推荐算法进行封装，来达到方便用户使用联邦学习进行推荐应用的目的。 本文下面将会介绍何在隐语中使用DeepFM算法

source: Introduction to the principle of DeepFM splitting
sl: DeepFM拆分原理介绍

source: The DeepFM algorithm combines the strengths of FM and neural networks, can improve low-dimensional and high-dimensional features at the same time. Compared with the Wide&Deep model, DeepFM algorithm also eliminates the feature engineering part.
sl: DeepFM算法结合了FM和神经网络的长处，可以同时提升低维和高维特征，相比Wide&Deep模型还免去了特征工程的部分。

source: From the overall structure, This model can be divided into two parts, namely the FM part and the Deep part. The input of these two parts is the same, and there is no distinction like the Wide & Deep model. The Deep part is used to train the high-dimensional correlations of these features, while the FM model calculates the two-dimensional cross information between features through the hidden vector v.
sl: 整体上来看。这个模型可以分成两个部分，分别是FM部分以及Deep部分。这两个部分的输入是一样的，并没有像Wide & Deep模型那样做区分。Deep的部分用来训练这些特征的高维的关联，而FM模型会通过隐藏向量V的形式来计算特征之间的二维交叉的信息。

source: DeepFM On SecretFlow
sl: 隐语中的DeepFM

source: Split Scheme
sl: 拆分方案

source: DeepFM formula derivation
sl: DeepFM公式推导

source: Mathematical simplification
sl: 进行数学化简

source: end up with the formula
sl: 最终得到公式

source: DeepFM split version
sl: DeepFM拆分版本

source: It can be seen from the derivation of the above formula that :math:`V_j` is eliminated in the calculation of FM
sl: 从上面的公式推导可以看出，FM的计算中消去了$V_j$

source: So the problem turns to as long as each party calculates their own :math:`\sum_{i}^kViX` and :math:`\sum_{i}^kV_i^2X^2`, continue to simplify this formula to get
sl: 所以问题就转成了只要每方计算好自己的 $\sum_{i}^kViX$ 和 $\sum_{i}^kV_i^2X^2$ 继续对这个公式进行化简得到

source: Extended to 2 parties, assuming that alice and bob have Na and Nb features respectively, then
sl: 扩展到2方，假设alice和bob分别由Na和Nb个特征，那么

source: It can be seen from the derivation of the formula that each participant only needs to calculate the first order :math:`\sum_{i=1}^aV_{i,f}x_i` and :math:`\sum_{i=1}^aV_{i,f}^2{x_i}^2` locally, and then transmit the two parts (1) and (2) to fusenet to complete the lossless fm part calculation
sl: 从公式推导中可以看出，对于每一方参与者只需要在本地算出一阶$\sum_{i=1}^aV_{i,f}x_i$和$\sum_{i=1}^aV_{i,f}^2{x_i}^2$ 然后传输（1）和（2）两部分到fusenet即可完成无损的fm部分计算

source: The dimension of the original V_vector is ``batchsize*Na*k``, and the dimension of Bob is ``batchsize*Nb*k``
sl: 其中原始的V_vector的维度是batchsize*Na*k， Bob的维度是batchsize*Nb*k

source: The data actually transmitted after derivation:
sl: 经过推导之后实际传输的数据：

source: - The dimension of (1) is ``batchsize*1``, which will not leak the information of the v matrix
sl: -(1) 的维度是batchsize*1,不会泄露v矩阵的信息

source: - The dimension of (2) is ``batchsize*K``, the information on the feature dimension has been eliminated, and only the sum information on the FM vector dimension is retained (usually dim=4)
sl: -(2) 的维度是batchsize*K，对于特征维度的信息已经消去，只保留了FM vector dimension上的和信息（通常dim=4）

source: SecretFlow encapsulation
sl: 隐语封装

source: Our application in SecretFlow provides packaging for various applications. The encapsulation of DeepFM is in secretflow/ml/nn/applications/sl_deep_fm.py, which provides ``DeepFMBase`` and ``DeepFMFuse`` two modules.
sl: 我们在隐语中提供了对于各种应用的封装。 关于DeepFM的封装在secretflow/ml/nn/applications/sl_deep_fm.py，提供了`DeepFMBase`和`DeepFMFuse`两个模块。

source: **Let’s take an example to see how to use DeepFM packaged in SecretFlow for training and prediction**
sl: 下面我们通过一个例子来看一下如果使用隐语封装的DeepFM来进行训练和预测

source: Environment settings
sl: 环境设置

source: Dataset introduction
sl: 数据集介绍

source: We will use the most classic **MovieLens** dataset for demonstration here. **MovieLens** is an open recommendation system dataset that includes movie ratings and movie metadata information.
sl: 我们这里将使用最经典的MovieLens数据集来进行演示。 MovieLens是一个开放式的推荐系统数据集，包含了电影评分和电影元数据信息。

source: `Dataset address <https://secretflow-data.oss-accelerate.aliyuncs.com/datasets/movielens/ml-1m.zip>`__
sl: `数据集地址 <https://secretflow-data.oss-accelerate.aliyuncs.com/datasets/movielens/ml-1m.zip>`__

source: We split the data:
sl: 我们对数据进行了切分：

source: For details about DataBuilder, please see CustomDataLoaderOnSL
sl: DataBuilder相关的细节内容，请查看CustomDataLoaderOnSL

source: Download and process data
sl: 下载并处理数据

source: Data splitting
sl: 数据拆分处理

source: So far we have completed the data processing and splitting
sl: 到此为止我们已经完成了数据的处理和拆分

source: Produced
sl: 产出了

source: Build data_builder_dict
sl: 构造data_builder_dict

source: DeepFMBase has 4 parameters:
sl: DeepFMBase有4个参数：

source: - dnn_units_size: This parameter needs to provide a list to define the dnn part, such as [256,32] means that the two hidden layers in the middle are 256 and 32 respectively
sl: -dnn_units_size: 这个参数需要提供一个list来对dnn部分进行定义，比如[256,32]意思是中间两个隐层分别是256，和32

source: - dnn_activation: activation function of dnn, eg:relu
sl: -dnn_activation: dnn 的激活函数，eg:relu

source: - preprocess_layer: Need to process the input, pass in a defined keras.preprocesslayer
sl: -preprocess_layer: 需要对输入进行处理，传入一个定义好的keras.preprocesslayer

source: - fm_embedding_dim: Dimensions of fm vector
sl: -fm_embedding_dim: fm vector的维度是多少

source: Define Fusenet
sl: 定义Fusenet

source: Run it
sl: 运行起来看看

source: So far, we have used the deepfm package provided by SecretFlow to complete the recommendation task training on the **MovieLens** dataset.
sl: 到此为止，我们已经使用隐语提供的deepfm封装完成了movieLens数据集上的推荐任务训练。

source: Summarize
sl: 总结

source: This article demonstrates how to use SecretFlow to implement DeepFM through the recommendation task on the **MovieLens** dataset
sl: 本文通过movieLens数据集上的推荐任务来演示了如何通过隐语来实现DeepFM。

source: you need:
sl: 您需要：

source: 1. Download and split the dataset
sl: 1.下载并拆分数据集；

source: 2. Define the dataloader for data processing
sl: 2.定义好数据处理的dataloader；

source: 3. Define the preprocesslayer for data preprocessing, define the dnn structure, and call DeepFMBase and DeepFMFuse to define the model
sl: 3.定义好数据预处理的preprocesslayer,定义好dnn结构，调用DeepFMBase，DeepFMFuse来进行模型定义；

source: 4. Use SLModel for training, prediction, and evaluation.
sl: 4.使用SLModel进行训练，预测，评估即可。

source: You can try it on your own dataset, if you have any questions, you can discuss it on github
sl: 您可以在自己的数据集上进行尝试，如有任何问题，可以在github上进行讨论。
