Repository: secretflow/secretflow
Catalog: docs/locales/*/LC_MESSAGES/tutorial/*_with_spu.po
Languages: nn

source: Neural Network with SPU
nn: SPU 训练神经网络

source: Please read lab `Logistic Regression On SPU <./lr_with_spu.ipynb>`__ first if you have not。
nn: 请先阅读 `Logistic Regression On SPU <./lr_with_spu.ipynb>`__ 。

source: In lab `Logistic Regression On SPU <./lr_with_spu.ipynb>`__, we have showed how to use SecretFlow/SPU to convert a plaintext JAX training program to a secure MPC training program.
nn: 在实验 `Logistic Regression On SPU <./lr_with_spu.ipynb>`__ 中，我们展示了如何使用 SecretFlow/SPU 将明文 JAX 训练程序转换为安全 MPC 训练程序。

source: In this lab, the idea is quite similar but this time we will work with a Neural Network model.
nn: 在这个实验室中，这个想法非常相似，但这次我们将使用神经网络模型。

source: We are going to use the same dataset and all the settings as lab `Logistic Regression On SPU <./lr_with_spu.ipynb>`__.
nn: 我们将使用相同的数据集和所有设置。

source: And first, let’s work out the plaintext model.
nn: 首先，让我们制定明文模型。

source: The following codes are demos only. It’s **NOT for production** due to system security concerns, please **DO NOT** use it directly in production.
nn: 注意： 以下代码仅供演示用途，在演示过程中可能会揭露部分信息。请勿直接将此示例代码用于实际生产环境中。在实际部署前，请根据您的具体需求和安全标准进行必要的修改和调整。

source: This tutorial needs more resources than 8c16g, which is the minimum requirement of SecretFlow.
nn: 本教程需要比 8c16g 更多的资源，这是 SecretFlow 的最低要求。

source: Train a model with JAX/FLAX
nn: 使用 JAX/FLAX 训练模型

source: Load the Dataset
nn: 加载数据集

source: The below is just copied from lab `Logistic Regression On SPU <./lr_with_spu.ipynb>`__. I’m not going to explain again.
nn: 以下内容是复制于实验 `Logistic Regression On SPU <./lr_with_spu.ipynb>`__ 。 我不会再次在这里解释。

source: Define the Model
nn: 定义模型

source: We are going to use a 4-layer `MLP <https://en.wikipedia.org/wiki/Multilayer_perceptron>`__ model with a `ReLU <https://en.wikipedia.org/wiki/Rectifier_(neural_networks)>`__ activation function here.
nn: 我们将使用 4 层 `MLP <https://en.wikipedia.org/wiki/Multilayer_perceptron>`__ 模型和 `ReLU <https://en.wikipedia.org/wiki/Rectifier_(neural_networks)>`__ 激活函数。

source: Then we define the training method here.
nn: 然后我们在这里定义训练方法。

source: Validate the Model
nn: 验证模型

source: We use AUC as the validation metric.
nn: 我们使用 AUC 作为验证指标。

source: BUILD Together
nn: 放在一起

source: Let’s put everything together and train a plaintext NN model!
nn: 让我们把所有东西放在一起，训练一个明文神经网络模型！

source: Must keep the number of AUC in mind, we are going to repeat the training with SPU. Let’s do that magic!
nn: 请记住这里的 AUC，因为我们想用 SPU 做类似的事情！

source: Train a Model with SPU
nn: 使用 SPU 训练模型

source: Let’s check params from SPU program.
nn: 让我们检查 SPU 程序的参数。

source: Lastly, let’s validate the model.
nn: 最后，让我们验证模型。

source: This is the end of the lab.
nn: 实验到此结束。
